'''
5.2已知:
x=[ 64.3, 99.6, 145.45, 63.75, 135.46, 92.85, 86.97, 144.76, 59.3, 116.03]
y=[ 62.55, 82.42, 132.62, 73.31, 131.05, 86.57, 85.49, 127.44, 55.25, 104.84]
计算:
(1)w
(2)b
    其中，x,y 分别是数组x和y的均值，x, 和y,是数组中索引值为i的元素。
(3)分别输出W和b的结果。
'''
import numpy as np;

x = np.array([ 64.3, 99.6, 145.45, 63.75, 135.46, 92.85, 86.97, 144.76, 59.3, 116.03]);
y = np.array([ 62.55, 82.42, 132.62, 73.31, 131.05, 86.57, 85.49, 127.44, 55.25, 104.84]);

#求题(1)
averX = np.sum(x)/x.size;       #x的平均数
averY = np.sum(y)/y.size;       #y的平均数
mol=0;
den=0;
for i in range(0,x.size):
    mol += (x[i]-averX)*(y[i]-averY);      #分子 
    den += (x[i]-averX)*(x[i]-averX);      #分母
w = mol/den;
print("w =",w);      #题(1)的答案

#求题(2)
b = averY-w*averX;      
print("b =",b);        #题(2)的答案

