'''
这是一个商品房销售记录表，请根据表中的数据，按下列要求绘制散点图。其中横坐标为商品房面积，纵坐标为商品房价格。
要求：
1. 绘制散点图，数据点为红色圆点；(3分）
2. 标题为:“商品房销售记录”，字体颜色为蓝色，大小为16；(1分）
3. 横坐标标签为:“面积(平方米)”，纵坐标标签为“价格(万元)”，字体大小为14。(1分)
'''

import matplotlib.pyplot as plt;
import numpy as np;

plt.rcParams["font.sans-serif"] = "SimHei";     #设置字体

x = np.array([137.97,104.50,100.00,124.32,79.20,99.00,124.00,114.00,106.69,138.05,53.75,46.91,68.00,63.02,81.26,86.21]);
y = np.array([145.00,110.00,93.00,116.00,65.32,104.00,118.00,91.00,62.00,133.00,51.00,45.00,78.50,69.65,75.59,95.30]);

plt.scatter(x,y,color="r",marker=".");      #绘制数据点
plt.title("商品房销售记录",color="b",fontsize=16);      #标题
plt.xlabel("面积(平方米)",fontsize=14);     #横坐标标签
plt.ylabel("价格(万元)",fontsize=14);       #纵坐标标签
plt.show();
